// ================================================
//描 述 :  
//作 者 : 杜鑫 
//创建时间 : 2021-07-10 19-57-45  
//修改作者 : 杜鑫 
//修改时间 : 2021-07-10 19-57-45  
//版 本 : 0.1 
// ===============================================
public enum ServerTypeEnum
{
    /// <summary>
    /// 无
    /// </summary>
    None = 0,
    /// <summary>
    /// 内网
    /// </summary>
    Intranet = 1,
    /// <summary>
    /// 外网
    /// </summary>
    Extranet = 2,
    /// <summary>
    /// 正式服
    /// </summary>
    Formal = 3
}